In [14]:
import pandas as pd
from pandas import Series, DataFrame

In [15]:
print(pd.__version__)

1.0.5

In [4]:
students = pd.read_csv("students.csv")

In [11]:
students

     Name Father Name Class  Marks
0  Zunaib       Afzal   5th     70
1   Usman      Sohail   8th     85
2   Moeed      Prince   9th     68

In [10]:
students.head(2)

     Name Father Name Class  Marks
0  Zunaib       Afzal   5th     70
1   Usman      Sohail   8th     85

In [9]:
students.index

RangeIndex(start=0, stop=3, step=1)

In [27]:
obj = Series([4, 7, 5, 3])
obj

0    4
1    7
2    5
3    3
dtype: int64

In [28]:
obj[1]

7

In [23]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [24]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [33]:
obj = Series([4, 7, -5, 3], index=["Jan", "Feb", "Mar", "Apr"])
obj

Jan    4
Feb    7
Mar   -5
Apr    3
dtype: int64

In [37]:
obj["Mar"]

-5

In [41]:
obj[obj > 3]

Jan    4
Feb    7
dtype: int64

In [47]:
students = pd.read_csv("students.csv")

In [49]:
stu = students["Marks"]

     Name Father Name Class  Marks
0  Zunaib       Afzal   5th     70
1   Usman      Sohail   8th     85
2   Moeed      Prince   9th     68

In [54]:
stu = students["Marks"]

In [52]:
stu[stu > 70]

1    85
Name: Marks, dtype: int64

In [58]:
names = students[["Name", "Father Name"]]

In [59]:
names

     Name Father Name
0  Zunaib       Afzal
1   Usman      Sohail
2   Moeed      Prince